{
    "version": "https://jsonfeed.org/version/1",
    "title": "Chad&#x27;s Sandbox",
    "description": "",
    "home_page_url": "https://chadballay.com",
    "feed_url": "https://chadballay.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Chad Ballay"
    },
    "items": [
        {
            "id": "https://chadballay.com/actions-not-words/",
            "url": "https://chadballay.com/actions-not-words/",
            "title": "Actions Not Words",
            "summary": "I’m going to start this off with the main point. I love this realization for my mom. In a very real sense of the world it reassures me. I’m too damn old though to not realize that the tone of what I say leaves this too nuainced to properly convey&hellip;",
            "content_html": "<p>I’m going to start this off with the main point.  I love this realization for my mom.  In a very real sense of the world it reassures me.  I’m too damn old though to not realize that the tone of what I say leaves this too nuainced to properly convey it on some shitty blog post.</p>\n<p>Recently, I had her travel with me for some medical tourism.  Whole other subject around me having a food addicition, weightloss surgery, and american healthcare.  Took a week and flew out to meet me in San Diego, to go over into Mexico, and to be their while I was getting a gastric bypass.  Flew back with me to Arkansas and then left to go back to her own home.  This is the longest Mother/Son trip we’ve taken and the circumstances were a damn minefield. </p>\n<p>She told me how she was worried that I was being hasty in getting this surgery.  She’s my mom so everything around this surgery trampled upon her sense of motherhood for me.  But she also told me that if it is what I feel I need to do then she’ll be there to help me.  That wasn’t some idle comment, either.  I’m 43 years old and having to let my mom help me so that I didn’t violate the medical restrictions was hard.  I’m physically capable and should be the one who is helping <em>HER</em> with <em>HER</em> luggage.  Never should it be that she has to do that for me.  (Seriously, it was weird having to stand aside for things like that.)</p>\n<p>When it was time for her to fly back to her home she was torn.  It’ll be a while before I’m fully healed, so when does her time needing to mother me stop?  Once we get back to Arkansas?  Once I’m safely at my house?  When everything around my house that can be prepared to ease my recovery is taken care of?  There is no wrong answer since it is situational.  Any of those points work.  </p>\n<p>This is where the premise comes in.  She did all these actions to show that she cares for me and then when I worried about her not taking care of her own things and life she opened up to me.  My family is not a big talking family.  Oprah, Dr Phil, all the therapist have made it so damn clear that people need to talk more about their feelings.  And they are probably right that people should.  It just isn’t my family’s way.  My family’s way did make a uniq zigzag in that direction for me and my mom.  </p>\n<p>She told me in her own way what she’s been doing for herself during her retirement.  Much of it wasn’t new news, her life isn’t a mysteriously shrouded secret.  This was her letting me know she’s taking care of herself and neglecting things.  As a grown up tempering the childlike desire to have everything go your way with the overcompensating adult desire to handle your own responsibilities is a hard one for me.  Do I wish my mom lived closer?  Yes.  Do I wish my mom had the easiest life she could want?  Yes.  Do I acknowledge that isn’t possible because we don’t live in a rainbow-filled unicorn nature preserve?  Yes.</p>\n<p>When she checked in with me about her leaving “too soon” I’m not sure how to explain this but it was a reassurance.  Timing didn’t workout for her to have much grandma time with the kids.  Timing never works out for everything to be accomplished.  Her time with them would’ve cut into her limited time during her husband’s days off.  Seeing that my mom has a life beyond Mom and Grandma isn’t a new thing.  Seeing her look at a situation, weigh the options, and choose her own needs was an act that let me know I don’t have to worry.  I can put down worrying on her behalf that she’s sacrificing too much and know that she’s an adult and sets boundaries that she needs.  </p>\n<p>Again, not one IOTA of this is a new or unwelcome bit of information.  But sometimes you just need the familar comfort of reassuring actions from your mom to help you feel better when you are feeling sick.  ;-)</p>\n",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
            ],
            "date_published": "2023-03-25T06:54:14-05:00",
            "date_modified": "2023-03-25T06:54:14-05:00"
        },
        {
            "id": "https://chadballay.com/wgu/",
            "url": "https://chadballay.com/wgu/",
            "title": "WGU",
            "summary": "Just now starting looking at the first class I'm taking at WGU. It's 1:44 AM on Saturday... Why I'm not asleep, I just don't know. What I do know is that I'm doubting my decision to do this degree. The work will be a slog. Not complex enough to make&hellip;",
            "content_html": "<p>Just now starting looking at the first class I'm taking at WGU.  It's 1:44 AM on Saturday...  Why I'm not asleep, I just don't know.  What I do know is that I'm doubting my decision to do this degree.  The work will be a slog.  Not complex enough to make me fear if I can do it.  More along the lines of is it a good ROI on my time.  Am I using this to avoid doing something harder that has a lower chance of success? I dunno.  I guess I'll find out though come April.  </p>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
            ],
            "date_published": "2023-03-25T01:47:17-05:00",
            "date_modified": "2023-03-25T01:47:17-05:00"
        },
        {
            "id": "https://chadballay.com/a-mind-is-a-terrible-thing-to-waste/",
            "url": "https://chadballay.com/a-mind-is-a-terrible-thing-to-waste/",
            "title": "A Mind Is A Terrible Thing To Waste",
            "summary": "My laptop has started getting flaky. I would be go along using it and then a random crash would occur. Or a reboot would fail. Etc, etc, etc... Confirmed my suspicions by running a memory diagnostic and found that the RAM is failing. $100 or so later and when the&hellip;",
            "content_html": "<p>My laptop has started getting flaky.  I would be go along using it and then a random crash would occur.  Or a reboot would fail.  Etc, etc, etc...  Confirmed my suspicions by running a memory diagnostic and found that the RAM is failing. $100 or so later and when the parts get here I'll be able to swap out 16GB of ram for an upgrade of 32GB.  Shout out to <a href=\"https://www.ifixit.com/\" target=\"_blank\" rel=\"noopener noreferrer\">iFixIt.com</a> and their <a href=\"https://www.ifixit.com/Guide/Lenovo+ThinkPad+T480+RAM+Replacement/139943\" target=\"_blank\" rel=\"noopener noreferrer\">Lenovo Thinkpad T480 Ram Replacement</a> guide.</p>\n<p>All this has me wondering when will we get to do that for humankind.  The ability to multi-task and have short term memory enough to remember what the hell I just walked into a room to retrieve would be amazing.  I'm definitely feeling that middle age crunch of more things to juggle and less ability to mentally juggle them.  I've started doing little hacks to help me remember.  Leave important things in doorways so that I have to see and deal with them as I leave the house.  Write lists upon lists of things to remember.  Make the kids be responsible for their own cognitive loads.  (They want me to remember to bring them to the park....  No if they don't remember then it doesn't happen.)</p>\n<p>All of these coping mechanisms are ones that I've picked up from watching TV or seeing other people tread upon this same path.  But what would happen if like my computer we could fix and even make our mental abilities better.  So many classic movies and tales would suddenly not resonate as much.  Would society be better?  Sometimes me forgetting ends up being a signal that whatever it was, it wasn't important enough.  A built in first-pass filter.  A need for setting up better boundaries for one's capacity would be needed.  Just because you can remember to do something doesn't mean it has to be done....</p>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
            ],
            "date_published": "2023-02-26T09:28:38-06:00",
            "date_modified": "2023-02-26T09:28:38-06:00"
        },
        {
            "id": "https://chadballay.com/apathy-wins/",
            "url": "https://chadballay.com/apathy-wins/",
            "title": "Apathy Wins",
            "summary": "Started trawling through the PPP dataset and decided to focus on Bentonville based loans. That was a mistake. So many businesses that I know thrived during the pandemic or otherwise took advantage of the PPP loan program. Business where the owner has been publicly hateful to minorities. Or dismissive of&hellip;",
            "content_html": "<p>Started trawling through the PPP dataset and decided to focus on Bentonville based loans.  That was a mistake.  So many businesses that I know thrived during the pandemic or otherwise took advantage of the PPP loan program.  Business where the owner has been publicly hateful to minorities.  Or dismissive of any social program that helps people since they hate socialism for everyone else but themselves.  So much damn money and all of it forgiven.  Just a straight up wealth transfer on the backs of those who pay taxes.... 1/2 a million for the local restruant owner who was anti-korean.  20k for a \"consultant\" who looks to have did it just to get a loan.</p>\n<p>And when I talked about it with friends I got two reactions.  Sympathetic sounds and apathy.  I have a bit of a sample bias going on since I'm talking to my own set of friends.  The sympathetic sounds part was good.  My friends doing what they can to de-ruffle my feathers.  But the apathy was just too much.  I don't have the reserves to give a St Crispins Day speech and somehow make the world be right.  It just ain't my wheelhouse.  So this leaves me drained and even more disappointed in our system.  </p>\n<p><a href=\"https://docs.google.com/spreadsheets/d/17OaOvNZsRaD6PtZM3Di1MfCCL7_x9XAT/edit?usp=sharing&amp;ouid=104180701464104876597&amp;rtpof=true&amp;sd=true\" target=\"_blank\" rel=\"noopener noreferrer\">In any case here is the Bentonville specific dataset I put together.</a>  </p>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
                   "PPP"
            ],
            "date_published": "2023-02-12T18:15:46-06:00",
            "date_modified": "2023-02-12T18:15:46-06:00"
        },
        {
            "id": "https://chadballay.com/cant-stop-the-signal-mal/",
            "url": "https://chadballay.com/cant-stop-the-signal-mal/",
            "title": "Can&#x27;t stop the signal, Mal.",
            "summary": "I've gotten antsy about not doing some sort of large project. A side hustle to either push my understanding or create a new bullet point on my resume. I have plenty of work and other interests but a weak siren's call keeps rattling around in my brain. So I'll start&hellip;",
            "content_html": "<p>I've gotten antsy about not doing some sort of large project.  A side hustle to either push my understanding or create a new bullet point on my resume.  I have plenty of work and other interests but a weak siren's call keeps rattling around in my brain.  So I'll start a project and hopefully it pans. </p>\n<p>First step is to pull a large dataset.  For this I'm using the PPP loan data.  You can get it <a href=\"https://data.sba.gov/dataset/ppp-foia\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>. [<a href=\"https://data.sba.gov/dataset/ppp-foia\">https://data.sba.gov/dataset/ppp-foia</a>]  <figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/15/Screenshot-from-2023-02-06-03-15-10.png\" alt=\"\" width=\"425\" height=\"276\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-15-10-xs.png 300w ,https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-15-10-sm.png 480w ,https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-15-10-md.png 768w\"></figure>\n<p>It's several very large files.  First is the data dictionary and then it's twelve 400MB+ files.  There is 10.5 million records in total that'll have to be processed.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/15/Screenshot-from-2023-02-06-03-14-04.png\" alt=\"\" width=\"295\" height=\"325\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-14-04-xs.png 300w ,https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-14-04-sm.png 480w ,https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-14-04-md.png 768w\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/15/Screenshot-from-2023-02-06-03-17-15.png\" alt=\"\" width=\"301\" height=\"217\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-17-15-xs.png 300w ,https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-17-15-sm.png 480w ,https://chadballay.com/media/posts/15/responsive/Screenshot-from-2023-02-06-03-17-15-md.png 768w\"></figure>\n<p>Next up is getting this data into a tool for use.  </p>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
                   "PPP"
            ],
            "date_published": "2023-02-06T03:26:35-06:00",
            "date_modified": "2023-02-06T04:14:16-06:00"
        },
        {
            "id": "https://chadballay.com/disclose-the-agent-writeup/",
            "url": "https://chadballay.com/disclose-the-agent-writeup/",
            "title": "Disclose The Agent - Write up",
            "summary": "Decided to start back up with some basic training after someone mentioned LetsDefend.io. The site impressed me. Here is a writeup on one of their public facing challenges that kind of shows what to expect. Disclose the Agent Premise is that you've got a PCAP file and you need to&hellip;",
            "content_html": "<p>Decided to start back up with some basic training after someone mentioned <a href=\"https://letsdefend.io/\" target=\"_blank\" rel=\"noopener noreferrer\">LetsDefend.io</a>. The site impressed me. Here is a writeup on one of their public facing challenges that kind of shows what to expect. <a href=\"https://app.letsdefend.io/challenge/disclose-the-agent\" target=\"_blank\" rel=\"noopener noreferrer\">Disclose the Agent</a> Premise is that you've got a PCAP file and you need to identify who the secret agent is, what they are doing, and who they are communicating with.</p>\n<ol>\n<li>Grab the PCAP file. <br><a href=\"https://api.letsdefend.io/download/downloadfile/smtpchallenge.zip\" target=\"_blank\" rel=\"noopener noreferrer\">https://api.letsdefend.io/download/downloadfile/smtpchallenge.zip</a> <br>Pass: 321 <br><br></li>\n<li>Load it into WireShark.<br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/screenshot-from-2023-01-27-05-57-30.png\" alt=\"\" width=\"1406\" height=\"677\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/screenshot-from-2023-01-27-05-57-30-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/screenshot-from-2023-01-27-05-57-30-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/screenshot-from-2023-01-27-05-57-30-md.png 768w\"></figure><br><br></li>\n<li>What is the email address of Ann's secret boyfriend? <br>Looked through the pcap file for all the From: and To: SMTP packets. From there I was able to see this. <a href=\"mailto:mistersecretx@aol.com\">mistersecretx@aol.com<br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/screenshot-from-2023-01-31-22-41-35.png\" alt=\"\" width=\"1126\" height=\"408\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/screenshot-from-2023-01-31-22-41-35-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/screenshot-from-2023-01-31-22-41-35-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/screenshot-from-2023-01-31-22-41-35-md.png 768w\"></figure></a><br><br></li>\n<li>What is Ann's email password?<br>This one took a bit more.  First thing was to look for some sort of PASS/AUTHENTICATE type interaction...  Oh wait, it literally says that.  The next step is decoding the string.  Used python but it isn't the only way.<br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/Screenshot-from-2023-02-05-17-52-30.png\" alt=\"\" width=\"923\" height=\"76\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-17-52-30-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-17-52-30-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-17-52-30-md.png 768w\"></figure><br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/Screenshot-from-2023-02-05-18-00-24.png\" alt=\"\" width=\"492\" height=\"50\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-00-24-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-00-24-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-00-24-md.png 768w\"></figure><br><br></li>\n<li>What is the name of the file that Ann sent to his secret lover?<br>For this one I used Wireshark's Follow function to see all the packets for this one SMTP message.  Then when it presented the total message I found the section for the attached document.<br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/Screenshot-from-2023-02-05-18-34-13.png\" alt=\"\" width=\"1398\" height=\"377\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-34-13-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-34-13-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-34-13-md.png 768w\"></figure><br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/Screenshot-from-2023-02-05-18-35-16.png\" alt=\"\" width=\"736\" height=\"270\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-35-16-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-35-16-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-05-18-35-16-md.png 768w\"></figure><br><br></li>\n<li>In what country will Ann meet with her secret lover?<br>This one was a bit harder. There was a reference about bringing a swimsuit in the body of the message but nothing more. To get it you had to grab the contents of the attachment and then build/view the file in an word doc application.  <br><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/Screenshot-from-2023-02-06-02-34-19.png\" alt=\"\" width=\"951\" height=\"753\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-06-02-34-19-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-06-02-34-19-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-06-02-34-19-md.png 768w\"></figure><br><br></li>\n<li>What is the MD5 value of the attachment Ann sent?<br>This one ended up being as simple as running a command. <figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chadballay.com/media/posts/14/Screenshot-from-2023-02-06-02-36-09.png\" alt=\"\" width=\"689\" height=\"62\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-06-02-36-09-xs.png 300w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-06-02-36-09-sm.png 480w ,https://chadballay.com/media/posts/14/responsive/Screenshot-from-2023-02-06-02-36-09-md.png 768w\"></figure><br><br></li>\n</ol>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
                   "Cybersecurity"
            ],
            "date_published": "2023-02-05T15:36:59-06:00",
            "date_modified": "2023-02-06T03:28:24-06:00"
        },
        {
            "id": "https://chadballay.com/impossible-list/",
            "url": "https://chadballay.com/impossible-list/",
            "title": "Impossible List",
            "summary": "Travel Go to Iceland and see the aurora or even the geography depending on the time of year. National Parks are America’s best idea and I want to see them all. Bryce Canyon Zion National Park Hot Springs Yellowstone Everglades Gateway Arch Grand Teton Great Smokey Mountains White Sands Grand&hellip;",
            "content_html": "<h2 id=\"travel\">Travel</h2>\n<ol>\n<li>Go to Iceland and see the aurora or even the geography depending on the time of year.</li>\n<li>National Parks are America’s best idea and I want to see them all.<ul>\n<li><del>Bryce Canyon</del></li>\n<li><del>Zion National Park</del></li>\n<li><del>Hot Springs</del></li>\n<li><del>Yellowstone</del></li>\n<li><del>Everglades</del></li>\n<li><del>Gateway Arch</del></li>\n<li><del>Grand Teton</del></li>\n<li><del>Great Smokey Mountains</del></li>\n<li><del>White Sands</del></li>\n<li>Grand Canyon</li>\n<li>Denali</li>\n<li>Arches</li>\n<li>Glacier</li>\n<li>Yosemite</li>\n<li>Big Bend</li>\n</ul>\n</li>\n<li>Visit Oktoberfest in Munich.</li>\n<li>Lafayette’s Tomb on July 4th.</li>\n<li>Colonial Williamsburg</li>\n<li>Headwaters of the Mississippi River</li>\n</ol>\n<h2 id=\"exercise\">Exercise</h2>\n<ol>\n<li>Running - A long time a go I set out to complete a marathon.  I made it up to a half marathon and quit.  That stings to this very day.<ul>\n<li><del>5k</del> (9/14/2019)</li>\n<li><del>10k</del> (10/5/2019)</li>\n<li>Half marathon</li>\n<li>Full marathon</li>\n</ul>\n</li>\n<li>Tough Mudder - I did 4 and I want to get to 10.<ul>\n<li>5th</li>\n<li>6th</li>\n<li>7th</li>\n<li>8th</li>\n<li>9th</li>\n<li>10th</li>\n</ul>\n</li>\n<li><del>Bike a 100 miles in one day</del>. (10/24/2020)</li>\n<li><del>Ride RAGBRAI.</del> (07/24/2022)</li>\n<li>Ride RAGBRAI all the way.</li>\n</ol>\n<h2 id=\"events\">Events</h2>\n<ol>\n<li>Defcon</li>\n<li>SXSW</li>\n<li>New Year’s Eve in Hawaii.</li>\n<li>New Year’s Day in Maine.</li>\n</ol>\n<h2 id=\"learning\">Learning</h2>\n<ol>\n<li><del>Complete a second bachelor’s</del></li>\n<li><del>Linux+</del></li>\n<li><del>Security</del>+</li>\n<li><del>GSEC</del></li>\n<li>Azure Administrator</li>\n</ol>\n<h2 id=\"financial\">Financial</h2>\n<ol>\n<li>Debt Free<ul>\n<li>Chase Credit Card</li>\n<li><del>Arvest Credit Card</del></li>\n<li><del>Toyota Car Loan</del></li>\n<li><del>Subaru Car Loan</del></li>\n</ul>\n</li>\n<li>Emergency fund to be 20k.</li>\n<li>Paid off house.</li>\n</ol>\n",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T21:32:04-06:00",
            "date_modified": "2023-02-01T21:34:56-06:00"
        },
        {
            "id": "https://chadballay.com/repeating-pattern/",
            "url": "https://chadballay.com/repeating-pattern/",
            "title": "Repeating Pattern",
            "summary": "find . -type f -exec grep -li TXT_STRING {} ; strings /dir/to/executable | grep TXT_STRING lsof -i -P -n ... ... The number of times that I have to run these same commands. Find the string of text that is in the log file and where did it come from.",
            "content_html": "<blockquote>\n<p dir=\"auto\"><code>find . -type f -exec grep -li TXT_STRING {} ; </code></p>\n<p dir=\"auto\"><code>strings /dir/to/executable | grep TXT_STRING </code></p>\n<p dir=\"auto\"><code>lsof -i -P -n ... ...</code></p>\n</blockquote>\n<p dir=\"auto\">The number of times that I have to run these same commands. Find the string of text that is in the log file and where did it come from. Or go spit out the ASCII strings from compiled code. Or what process has what port on a box.</p>\n<p dir=\"auto\">Tonight is just yet another night of seeing the same pattern get played out in new instances. Troubleshooting by following the recipe that hasn't changed in years.</p>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T05:14:42-06:00",
            "date_modified": "2023-02-06T03:48:46-06:00"
        },
        {
            "id": "https://chadballay.com/testing-out-nextjs/",
            "url": "https://chadballay.com/testing-out-nextjs/",
            "title": "Testing out Next.JS",
            "summary": "Well actually I'm testing out Publii more than anything.",
            "content_html": "<p>Well actually I'm testing out Publii more than anything.</p>",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T04:27:43-06:00",
            "date_modified": "2023-02-01T04:27:43-06:00"
        },
        {
            "id": "https://chadballay.com/big-feelings-with-big-songs/",
            "url": "https://chadballay.com/big-feelings-with-big-songs/",
            "title": "Big Feelings With Big Songs",
            "summary": "I have had to explain why I like musicals on a few occasions. Usually a soft pause happens in a conversation where that is revealed but occasionally a direct question is asked. It is always a weird one because I have to guess what level of info do I reveal.",
            "content_html": "<p>I have had to explain why I like musicals on a few occasions.  Usually a soft pause happens in a conversation where that is revealed but occasionally a direct question is asked.  It is always a weird one because I have to guess what level of info do I reveal.  </p>\n<p>Some of it is that the songs are catchy and usually the lyrics are clear to hear.  No multiple singers singing over each other usually.  With my hearing that’s sometimes a quick path into chaos.</p>\n<p>Some of it is because much of the lyrics are the inner voices of the character and it explains the motivation without breaking the fourth wall.  Being on the spectrum, I have a hard time understanding motivations.</p>\n<p>A lot of it is because I damn well like the art form and enjoy the fact that people get slightly miffed when they find out a 6’6” straight dude is into musicals and not football…..  Usually this doesn’t rile me up but this week had me get questioned as to why I would choose to not go to the TCU/Michigan Fiesta Bowl game.  </p>\n",
            "author": {
                "name": "Chad Ballay"
            },
            "tags": [
                   "Personal"
            ],
            "date_published": "2023-01-03T15:05:00-06:00",
            "date_modified": "2023-02-06T04:11:17-06:00"
        }
    ]
}
